ext_alsav/DataProcessors/ПечатьЭтикетокИЦенников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПечатьЭтикетокИЦенников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ext_alsav/InformationRegisters/алсав_НумерацияДляHOFF.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>алсав_НумерацияДляHOFF</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Позиция_HOFF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПродуктНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПродуктХарактеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьВСборке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция_АЛСАВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ext_alsav/DataProcessors/ПечатьЭтикетокИЦенников/Forms/ФормаТовары/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьПараметрыКлиент() ЭКСПОРТ
	Возврат ПолучитьПараметры();
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзмененииКлиент(Элемент) ЭКСПОРТ
	ТоварыНоменклатураПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзмененииКлиент(Элемент) ЭКСПОРТ
	ТоварыХарактеристикаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимКлиент(ПараметрРежим) ЭКСПОРТ
	// Вставить содержимое метода.
	УстановитьРежим(ПараметрРежим);
КонецПроцедуры

&НаКлиенте
Процедура алсав_алсав_ОткрытьPDFФайлыПосле(Команда)
	// Вставить содержимое обработчика.
	
	ффо = Новый Соответствие;
	
	
	
	Для каждого стр из Объект.Товары Цикл
		Если не стр.Выбран Тогда
			Продолжить;
		Конецесли;
		
		номенИнфо = ффо.Получить(стр.Номенклатура);
		Если номенИнфо = неопределено Тогда
			номенИнфо = Новый Структура("Номенклатура, Количество",стр.Номенклатура,0);
			ффо.Вставить(стр.Номенклатура,номенИнфо);
		конецЕсли;
		
		номенИнфо.Количество = номенИнфо.Количество + стр.КоличествоЭтикеток ;
		ффо[стр.Номенклатура] = номенИнфо;
		
	КонецЦикла;
	
	
	Для Каждого ел из ффо Цикл
		номенИнфо = ел.Значение;
		
		мФайлы = ПолучитьФайлы(номенИнфо.Номенклатура);
		файлы = "";
		Для Каждого файлСсылка из мФайлы цикл
			//ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(файлСсылка, Неопределено, УникальныйИдентификатор);
			//ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ПолучитьДанныеФайла(файлСсылка, Неопределено);
			ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляПечати(
				файлСсылка,
				УникальныйИдентификатор
			);

			
			обр = Новый ОписаниеОповещения("НапечататьФайлПослеПолученияВерсииВРабочийКаталог", ЭтотОбъект, номенИнфо);
			РаботаСФайламиСлужебныйКлиент.ПолучитьФайлВерсииВРабочийКаталог(
				обр,
				ДанныеФайла,
				"",
				УникальныйИдентификатор
			);
			//ПолноеИмяФайлаВРабочемКаталоге=РаботаСФайламиСлужебныйКлиент.алсав_ПолучитьПутьФайлаВРабочемКаталогеЭкспорт(ДанныеФайла);
			//
			//ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);
			//Если ЗначениеЗаполнено(ПолноеИмяФайлаВРабочемКаталоге) Тогда
			//	файлы = файлы + " """+ПолноеИмяФайлаВРабочемКаталоге+"""";
			//Иначе
			//	Сообщить("ПолноеИмяФайлаВРабочемКаталоге = пусто, " + файлСсылка);
			//Конецесли;
		КонецЦикла; 		
	конецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура НапечататьФайлПослеПолученияВерсииВРабочийКаталог(Результат, номенИнфо) Экспорт

	Если Результат.ФайлПолучен Тогда
		
		//НапечататьФайлПриложением(ПараметрыВыполнения.ДанныеФайла, Результат.ПолноеИмяФайла);
		
		файлы = """"+Результат.ПолноеИмяФайла+""""; 
		
		приложение = """C:\Program Files (x86)\SumatraPDF\SumatraPDF""";
		аргументы = " -print-to-default -print-settings """+номенИнфо.Количество+"x"" ";
		
		//аргументы = " -print-dialog ";
		
		кмд = приложение+аргументы+файлы;
		//сообщить(файлы);
		сообщить(кмд);
		
		ЗапуститьПриложение(кмд,,истина);

	КонецЕсли;
	
КонецПроцедуры




Функция ПолучитьФайлы(номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	               |ГДЕ НЕ ПометкаУдаления И
	               |	НоменклатураПрисоединенныеФайлы.ВладелецФайла В(&номенклатура)";
	
	Запрос.УстановитьПараметр("номенклатура",номенклатура);
	
	рез = Запрос.Выполнить().Выбрать();
	
	мРезульт = новый Массив;
	Пока рез.Следующий() Цикл
		мРезульт.Добавить(рез.Ссылка);
		
	КонецЦикла;
	
	возврат мРезульт;
КонецФункции

&НаКлиенте
Процедура алсав_ПечатьHOFFПосле(Команда)
		
	ОчиститьСообщения();
	
	РезультатПроверки = ВыполнитьПроверку(ЭтаФорма);
	Если Не РезультатПроверки.ТоварыВыбраны Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверки.ПроверкаВыполнена Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
		
		ИменаМакетов = "";
		
		Если Режим = "ПечатьЭтикетокИЦенников" Тогда
			ИменаМакетов = "ЭтикеткаТовары,ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЦенников" Тогда
			ИменаМакетов = "ЦенникТовары";
		ИначеЕсли Режим = "ПечатьЭтикеток" Тогда
			ИменаМакетов = "ЭтикеткаТовары";
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			ПараметрКоманды,
			ЭтаФорма,
			ПолучитьПараметрыHOFF());
		
	КонецЕсли;

КонецПроцедуры



&НаСервере
Функция ПолучитьПараметрыHOFF()
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("_ИКТ", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("_Артикул_HOFF", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("_Позиция_HOFF", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("_ШтрихкодВнешний", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенника", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ШаблонЭтикетки", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ОстатокНаСкладе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("КоличествоВДокументе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	
	
	позицияТовары = 0;
	
	//Для Каждого СтрокаТЧ Из Объект.Товары Цикл
	//	Если Не СтрокаТЧ.Выбран Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	тчПотребностьПозиции = алсав_НоменклатураОстатки.ПолучитьПотребность(
	//		СтрокаТЧ.Номенклатура,
	//		СтрокаТЧ.Характеристика,
	//		1
	//	);		
	//	
	//	_Артикул_HOFF = алсав_ДопРеквизиты.ПолучитьДопРеквизит(СтрокаТЧ.Характеристика,"Артикул HOFF");
	//			
	//	позицияТовары = позицияТовары + 1;
	//	_Позиция_HOFF_По_Количеству = 0;
	//	
	//	количествоВсего = 0;
	//	Для Каждого стр из тчПотребностьПозиции Цикл
	//		количествоВсего = количествоВсего + стр.Количество;
	//	КонецЦикла;
	//	количествоВсего = количествоВсего * СтрокаТЧ.КоличествоЦенников;
	//	количествоПозиция = 0;
	//	
	//	Для Каждого стр из тчПотребностьПозиции Цикл
	//		количество = СтрокаТЧ.КоличествоЦенников * стр.Количество;
	//		
	//		Пока количество > 0 Цикл 
	//			количество = количество - 1;
	//			количествоПозиция = количествоПозиция + 1;
	//			
	//			НоваяСтрока = Товары.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	//			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
	//				НоваяСтрока.КоличествоЭтикеток = 0;
	//			КонецЕсли;
	//			Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
	//				НоваяСтрока.КоличествоЦенников = 0;
	//			КонецЕсли;
	//			
	//			НоваяСтрока.Номенклатура = стр.Номенклатура;
	//			НоваяСтрока.Характеристика = стр.Характеристика;
	//			
	//			НоваяСтрока.Штрихкод = алсав_ПечатьСчет.Штрихкод(
	//				НоваяСтрока.Номенклатура,
	//				НоваяСтрока.Характеристика
	//			);
	//			
	//			НоваяСтрока.КоличествоЭтикеток = 1;//НоваяСтрока.КоличествоЭтикеток * стр.Количество;
	//			НоваяСтрока.КоличествоЦенников = 1;//НоваяСтрока.КоличествоЦенников * стр.Количество;
	//			
	//			НоваяСтрока._Артикул_HOFF = _Артикул_HOFF;
	//			
	//			Если СтрокаТЧ.Номенклатура <> НоваяСтрока.Номенклатура Тогда
	//				НоваяСтрока._Позиция_HOFF = ""+(количествоПозиция)+"/"+количествоВсего;
	//			Иначе
	//				НоваяСтрока._Позиция_HOFF = "1/1";
	//			КонецЕсли;
	//				
	//			
	//		КонецЦикла;
	//	КонецЦикла;	
	//КонецЦикла;
	
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		
		тчПотребностьПозиции = РегистрыСведений.алсав_НумерацияДляHOFF.ПолучитьПотребностьДляНумерации(СтрокаТЧ.Номенклатура,СтрокаТЧ.Характеристика);
		количествоУжеРазвёрнуто = ИСТИНА;
		Если тчПотребностьПозиции.Количество() = 0 Тогда
			тчПотребностьПозиции = алсав_НоменклатураОстатки.ПолучитьПотребность(СтрокаТЧ.Номенклатура,СтрокаТЧ.Характеристика,1);  
			количествоУжеРазвёрнуто = ЛОЖЬ;
		КонецЕсли;		
		//тчПотребностьПозиции = ПолучитьПотребность(СтрокаТЧ.Номенклатура,СтрокаТЧ.Характеристика,1);
		
		_Артикул_HOFF = алсав_ДопРеквизиты.ПолучитьДопРеквизит(СтрокаТЧ.Характеристика,"Артикул HOFF");
		_ИКТ = алсав_ПечатьСчет.ПолучитьАртикул(СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, неопределено);
				
		позицияТовары = позицияТовары + 1;
		_Позиция_HOFF_По_Количеству = 0;
		
		количествоВсего = 0;
		Для Каждого стр из тчПотребностьПозиции Цикл
			//количествоВсего = количествоВсего + 1;
			количествоВсего = количествоВсего + стр.Количество;
		КонецЦикла;
		количествоВсего = количествоВсего;// * СтрокаТЧ.КоличествоЦенников;
		количествоПозиция = 0;
		
		Для Каждого стр из тчПотребностьПозиции Цикл
			//количество = СтрокаТЧ.КоличествоЦенников * стр.Количество;
			количество = стр.Количество;
			//количествоПозиция = количествоПозиция + 1;
			
			Пока количество > 0 Цикл
				количествоПозиция = количествоПозиция + 1;
				количество = количество - 1;
				Если количествоУжеРазвёрнуто Тогда
					количество = 0;
				КонецЕсли;
				
				количествоЦенников = СтрокаТЧ.КоличествоЦенников;
				Пока количествоЦенников > 0 Цикл 
					количествоЦенников = количествоЦенников - 1;
					
					НоваяСтрока = Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
						НоваяСтрока.КоличествоЭтикеток = 0;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
						НоваяСтрока.КоличествоЦенников = 0;
					КонецЕсли;
					
					НоваяСтрока.Номенклатура = стр.Номенклатура;
					НоваяСтрока.Характеристика = стр.Характеристика;
					
					НоваяСтрока.Штрихкод = алсав_ПечатьСчет.Штрихкод(
						НоваяСтрока.Номенклатура,
						НоваяСтрока.Характеристика
					);
					
					НоваяСтрока._ШтрихкодВнешний = алсав_ПечатьСчет.ШтрихкодВнешний(
						НоваяСтрока.Номенклатура,
						НоваяСтрока.Характеристика
					);
					
					НоваяСтрока.КоличествоЭтикеток = 1;//НоваяСтрока.КоличествоЭтикеток * стр.Количество;
					НоваяСтрока.КоличествоЦенников = 1;//НоваяСтрока.КоличествоЦенников * стр.Количество;
					
					НоваяСтрока._ИКТ = алсав_ПечатьСчет.ПолучитьАртикул(НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, неопределено);
					НоваяСтрока._Артикул_HOFF = _Артикул_HOFF;
					
					//ХОФФ позиция исключение+++++++
					//
					Если СтрокаТЧ.Номенклатура <> НоваяСтрока.Номенклатура Тогда    
						Если количествоУжеРазвёрнуто Тогда
							НоваяСтрока._Позиция_HOFF = стр.Позиция;
						Иначе
							НоваяСтрока._Позиция_HOFF = ""+(количествоПозиция)+"/"+количествоВсего; 
						КонецЕсли;
						ПозицияХОФФИсключение = "";
						ПозицияХОФФИсключение = ПолучитьПозицияХОФФ(СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, НоваяСтрока.Номенклатура, НоваяСтрока.Характеристика, стр.ПутьВСборке, НоваяСтрока._Позиция_HOFF);
						Если ЗначениеЗаполнено(ПозицияХОФФИсключение) Тогда 
							НоваяСтрока._Позиция_HOFF = ПозицияХОФФИсключение;
						КонецЕсли
	
					Иначе
						НоваяСтрока._Позиция_HOFF = "1/1";
					КонецЕсли; 
					//------------------------------ 					
					//Если СтрокаТЧ.Номенклатура <> НоваяСтрока.Номенклатура Тогда
					//	НоваяСтрока._Позиция_HOFF = ""+(количествоПозиция)+"/"+количествоВсего;
					//Иначе
					//	НоваяСтрока._Позиция_HOFF = "1/1";
					//КонецЕсли;
					
				КонецЦикла; 
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	 	
	МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	УстановитьПривилегированныйРежим(Истина);
	ПравилоВыгрузкиВВесы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоОбмена, "ТипПодключаемогоОборудования") = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары", ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",   Объект.Организация);
	ПараметрыПечати.Вставить("ПравилоОбмена", Объект.ПравилоОбмена);
	ПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", МаксимальныйКодВесовогоТовара);
	ПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы",          ПравилоВыгрузкиВВесы);
	ПараметрыПечати.Вставить("ВидЦены",       Объект.ВидЦены);
	ПараметрыПечати.Вставить("Дата",          Объект.Дата);
	ПараметрыПечати.Вставить("Склад",         Объект.Склад);
	ПараметрыПечати.Вставить("ВидЦеныДополнительно", Объект.ВидЦеныДополнительно);
	ПараметрыПечати.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	
	Возврат ПараметрыПечати;
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьПозицияХОФФ(ПродуктНоменклатура,ПродуктХарактеристика,Номенклатура,Характеристика, ПутьВСборке, Позиция_АЛСАВ)
	Позиция_HOFF = "";  
	//Возврат Позиция_HOFF;
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	т.Позиция_HOFF КАК Позиция_HOFF
	               |ИЗ
	               |	РегистрСведений.алсав_НумерацияДляHOFF КАК т
	               |ГДЕ
	               |	т.ПродуктНоменклатура = &ПродуктНоменклатура
	               |	И т.ПродуктХарактеристика = &ПродуктХарактеристика
	               |	И т.Номенклатура = &Номенклатура
	               |	И т.Характеристика = &Характеристика
	               |	И т.ПутьВСборке = &ПутьВСборке
				   |	И т.Позиция_АЛСАВ = &Позиция_АЛСАВ";
	
	Запрос.УстановитьПараметр("ПродуктНоменклатура",ПродуктНоменклатура);
	Запрос.УстановитьПараметр("ПродуктХарактеристика",ПродуктХарактеристика);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",Характеристика);
	Запрос.УстановитьПараметр("ПутьВСборке",ПутьВСборке);
	Запрос.УстановитьПараметр("Позиция_АЛСАВ",Позиция_АЛСАВ);
	
	рез = Запрос.Выполнить().Выбрать();
	Если рез.Следующий() Тогда
		Позиция_HOFF = рез.Позиция_HOFF;
	КонецЕсли;
	
	Возврат Позиция_HOFF;
КонецФункции

&НаСервере
&Вместо("ПолучитьПараметры")
Функция алсав_ПолучитьПараметры()
	// Вставить содержимое метода.
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("_ИКТ", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("_ШтрихкодВнешний", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Товары.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Товары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	Товары.Колонки.Добавить("ШаблонЦенника", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЦенников", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ШаблонЭтикетки", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	Товары.Колонки.Добавить("КоличествоЭтикеток", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("ОстатокНаСкладе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("КоличествоВДокументе", Новый ОписаниеТипов("Число"));
	Товары.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", Новый ОписаниеТипов("Дата"));
	Товары.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);

		НоваяСтрока.Штрихкод = алсав_ПечатьСчет.Штрихкод(
			НоваяСтрока.Номенклатура,
			НоваяСтрока.Характеристика
		);
		
		НоваяСтрока._ШтрихкодВнешний = алсав_ПечатьСчет.ШтрихкодВнешний(
			НоваяСтрока.Номенклатура,
			НоваяСтрока.Характеристика
		);  
		
		_ИКТ = алсав_ПечатьСчет.ПолучитьАртикул(СтрокаТЧ.Номенклатура, СтрокаТЧ.Характеристика, неопределено);
		НоваяСтрока._ИКТ = _ИКТ;

		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
			НоваяСтрока.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЦенника) Тогда
			НоваяСтрока.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;
	
	МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	УстановитьПривилегированныйРежим(Истина);
	ПравилоВыгрузкиВВесы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоОбмена, "ТипПодключаемогоОборудования") = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары", ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",   Объект.Организация);
	ПараметрыПечати.Вставить("ПравилоОбмена", Объект.ПравилоОбмена);
	ПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", МаксимальныйКодВесовогоТовара);
	ПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы",          ПравилоВыгрузкиВВесы);
	ПараметрыПечати.Вставить("ВидЦены",       Объект.ВидЦены);
	ПараметрыПечати.Вставить("Дата",          Объект.Дата);
	ПараметрыПечати.Вставить("Склад",         Объект.Склад);
	ПараметрыПечати.Вставить("ВидЦеныДополнительно", Объект.ВидЦеныДополнительно);
	ПараметрыПечати.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	
	Возврат ПараметрыПечати;КонецФункции
